xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
/**
*   @file    Adc_Adc12bsarv2.c
*   @version 1.0.1
*
*   @brief   AUTOSAR Adc - low level driver source file.
*   @details This is the low level driver source file,mainly implemented for the ADC12BSARV2 hardware IP.
*
*   @addtogroup ADC
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.3 MCAL
*   Platform             : ARM
*   Peripheral           : ADC12BSARV2
*   Dependencies         : none
*
*   Autosar Version      : 4.3.1
*   Autosar Revision     : ASR_REL_4_3_REV_0001
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_3_REV_0001_20190621
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2019 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Adc_Adc12bsarv2_c_REF_1
* Violates MISRA 2004 Advisory Rule 19.1, only preprocessor statements and comments before "#include"
* This violation is not fixed since the inclusion of MemMap.h is as per Autosar requirement.
*
* @section Adc_Adc12bsarv2_c_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file .
* This comes from the order of includes in the .c file and from include dependencies. As a safe
* approach, any file must include all its dependencies. Header files are already protected against
* double inclusions.
*
* @section Adc_Adc12bsarv2_c_REF_3
* Violates MISRA 2004 Advisory Rule 11.3, A cast should not be performed between a pointer type and
* an integral type.
* The cast is used to access memory mapped registers.
*
* @section Adc_Adc12bsarv2_c_REF_4
* Violates MISRA 2004 Required Rule 14.7, Return statement before end of function.
* The return statement are used to simplify the code structure and easier readability.
*
* @section Adc_Adc12bsarv2_c_REF_5
* Violates MISRA 2004 Advisory Rule 11.4, Cast from pointer to pointer.
* This is used for the Speed optimization of the memory access.
*
* @section Adc_Adc12bsarv2_c_REF_6
* Violates MISRA 2004 Required Rule 10.3, Cast from unsign interger to sign interger
* This is used for calculate the dma source last
*
* @section Adc_Adc12bsarv2_c_REF_7
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall be checked to ensure that
* 31 characters significance and case sensitivity are supported for external identifiers.
* This violation is due to the requirement that requests to have a file version check.
*
* @section Adc_Adc12bsarv2_c_REF_8
* Violates MISRA 2004 Required Rule 17.4, Array indexing shall be the only allowed form of pointer
* arithmetic
* This violation is due to the code complexity.
*
* @section Adc_Adc12bsarv2_c_REF_9
* Violates MISRA 2004 Required Rule 11.1, cast from unsigned int to pointer. This macro computes the
* address of any register by using the hardware offset of the controller. The address calculated as an
* unsigned int is passed to a macro for initializing the pointer with that address.
*
* @section Adc_Adc12bsarv2_c_REF_10
* Violates MISRA 2004 Required Rule 8.10, all declarations and definitions of objects or functions
* at file scope shall have internal linkage unless external linkage is required.
* This violation is to be used by IPV layer.
*
* @section Adc_Adc12bsarv2_c_REF_14
* Violates MISRA 2004 Advisory Rule 16.7, A pointer parameter in a function prototype should be
* declared as 'pointer to const' if the pointer is not used to modify the addressed object.
* The pointer is used to modify the addressed object.
*
* @section Adc_Adc12bsarv2_c_REF_15
* Violates MISRA 2004 Required Rule 8.7, Objects shall be defined at block scope if they are only
* accessed from within a single function. These objects are used in various parts of the code
* 
* @section Adc_Adc12bsarv2_c_REF_16
* Violates MISRA 2004 Required Rule 1.2, place reliance on undefined or unspecified behaviour
* This is used for the code complexity.
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. All compilers used support more than 31 chars for
* identifiers.
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this Unit
==================================================================================================*/
#include "Adc_Ipw.h"
#ifndef USER_MODE_REG_PROT_ENABLED
#define USER_MODE_REG_PROT_ENABLED                (ADC_USER_MODE_REG_PROT_ENABLED)
#endif
#include "SilRegMacros.h"
/** @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file  */
#include "Adc_Reg_eSys_Adc12bsarv2.h"
/** @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file  */
#include "Adc_Adc12bsarv2_CfgEx.h"
#include "SchM_Adc.h"
#include "Adc_Adc12bsarv2.h"
#include "Adc_Pdb.h"
/** @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file  */
#include "Mcal.h"

#ifdef ADC_DMA_SUPPORTED
#include "CDD_Mcl.h"
#endif
#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF)
/** @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file  */
#include "Dem.h"
#endif

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define ADC_AR_VENDOR_ID_ADC12BSARV2_C                 43
/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#define ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C     4
/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#define ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C     3
/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#define ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_C  1
/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#define ADC_SW_MAJOR_VERSION_ADC12BSARV2_C             1
/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#define ADC_SW_MINOR_VERSION_ADC12BSARV2_C             0
/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#define ADC_SW_PATCH_VERSION_ADC12BSARV2_C             1

/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/
/* Check if source file and ADC IPW header file are from the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_C != ADC_VENDOR_ID_IPW_H)
    #error "Adc_Adc12bsarv2.c and Adc_Ipw.h have different vendor ids"
#endif

/* Check if source file and ADC IPW header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MAJOR_VERSION_IPW_H) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MINOR_VERSION_IPW_H) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_REVISION_VERSION_IPW_H) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Adc_Ipw.h are different"
#endif

/* Check if source file and ADC IPW header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_C != ADC_SW_MAJOR_VERSION_IPW_H) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_C != ADC_SW_MINOR_VERSION_IPW_H) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_C != ADC_SW_PATCH_VERSION_IPW_H) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2.c and Adc_Ipw.h are different"
#endif

/* Check if source file and Adc_Reg_eSys_Adc12bsarv2 header file are of the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_C != ADC_VENDOR_ID_REG)
    #error "Adc_Adc12bsarv2.c and Adc_Reg_eSys_Adc12bsarv2.h have different vendor ids"
#endif

