xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
/* Check if source file and Adc_Reg_eSys_Adc12bsarv2 header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MAJOR_VERSION_REG) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MINOR_VERSION_REG) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_REVISION_VERSION_REG) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Adc_Reg_eSys_Adc12bsarv2.h are different"
#endif

/* Check if source file and Adc_Reg_eSys_Adc12bsarv2 header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_C != ADC_SW_MAJOR_VERSION_REG) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_C != ADC_SW_MINOR_VERSION_REG) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_C != ADC_SW_PATCH_VERSION_REG) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2.c and Adc_Reg_eSys_Adc12bsarv2.h are different"
#endif

/* Check if source file and Adc_Adc12bsarv2_CfgEx header file are of the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_C != ADC_VENDOR_ID_ADC12BSARV2_CFGEX)
    #error "Adc_Adc12bsarv2.c and Adc_Adc12bsarv2_CfgEx.h have different vendor ids"
#endif

/* Check if source file and Adc_Adc12bsarv2_CfgEx header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_CFGEX) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_CFGEX) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_CFGEX) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Adc_Adc12bsarv2_CfgEx.h are different"
#endif

/* Check if source file and Adc_Adc12bsarv2_CfgEx header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_C != ADC_SW_MAJOR_VERSION_ADC12BSARV2_CFGEX) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_C != ADC_SW_MINOR_VERSION_ADC12BSARV2_CFGEX) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_C != ADC_SW_PATCH_VERSION_ADC12BSARV2_CFGEX) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2.c and Adc_Adc12bsarv2_CfgEx.h are different"
#endif

/* Check if source file and Adc_Adc12bsarv2 header file are from the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_C != ADC_VENDOR_ID_ADC12BSARV2)
    #error "Adc_Adc12bsarv2.c and Adc_Adc12bsarv2.h have different vendor ids"
#endif

/* Check if source file and Adc_Adc12bsarv2 header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Adc_Adc12bsarv2.h are different"
#endif

/* Check if source file and Adc_Adc12bsarv2 header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_C != ADC_SW_MAJOR_VERSION_ADC12BSARV2) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_C != ADC_SW_MINOR_VERSION_ADC12BSARV2) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_C != ADC_SW_PATCH_VERSION_ADC12BSARV2) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2.c and Adc_Adc12bsarv2.h are different"
#endif

/* Check if source file and Adc_Pdb header file are from the same vendor */
#if (ADC_AR_VENDOR_ID_ADC12BSARV2_C != ADC_VENDOR_ID_PDB)
    #error "Adc_Adc12bsarv2.c and Adc_Pdb.h have different vendor ids"
#endif

/* Check if source file and Adc_Pdb header file are of the same Autosar version */
#if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MAJOR_VERSION_PDB) || \
     (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_MINOR_VERSION_PDB) || \
     (ADC_AR_RELEASE_REVISION_VERSION_ADC12BSARV2_C != ADC_AR_RELEASE_REVISION_VERSION_PDB) \
    )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Adc_Pdb.h are different"
#endif

/* Check if source file and Adc_Pdb header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_ADC12BSARV2_C != ADC_SW_MAJOR_VERSION_PDB) || \
     (ADC_SW_MINOR_VERSION_ADC12BSARV2_C != ADC_SW_MINOR_VERSION_PDB) || \
     (ADC_SW_PATCH_VERSION_ADC12BSARV2_C != ADC_SW_PATCH_VERSION_PDB) \
    )
    #error "Software Version Numbers of Adc_Adc12bsarv2.c and Adc_Pdb.h are different"
#endif

/** @violates @ref Adc_Adc12bsarv2_c_REF_7 MISRA-C:2004 Rule 1.4: Identifier clash.*/
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF)
 /* Check if source file and Dem header file are of the same version */
 #if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != DEM_AR_RELEASE_MAJOR_VERSION) || \
      (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != DEM_AR_RELEASE_MINOR_VERSION) \
     )
    #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Dem.h are different"
 #endif
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */

 /* Check if source file and SilREgMacros header file are of the same AutoSar version */
 #if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != SILREGMACROS_AR_RELEASE_MAJOR_VERSION) || \
      (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != SILREGMACROS_AR_RELEASE_MINOR_VERSION) \
     )
 #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and SilRegMacros.h are different"
 #endif

 /* Check if source file and Mcal header file are of the same AutoSar version */
 #if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != MCAL_AR_RELEASE_MAJOR_VERSION) || \
      (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != MCAL_AR_RELEASE_MINOR_VERSION) \
     )
 #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and Mcal.h are different"
 #endif

 #ifdef ADC_DMA_SUPPORTED
  /* Check if source file and DMA header file are of the same Autosar version */
  #if ((ADC_AR_RELEASE_MAJOR_VERSION_ADC12BSARV2_C != MCL_AR_RELEASE_MAJOR_VERSION) || \
       (ADC_AR_RELEASE_MINOR_VERSION_ADC12BSARV2_C != MCL_AR_RELEASE_MINOR_VERSION)  \
      )
      #error "AutoSar Version Numbers of Adc_Adc12bsarv2.c and CDD_Mcl.h are different"
  #endif
 #endif
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/
#define ADC_START_SEC_CONST_32
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 */
#include "Adc_MemMap.h"

/**
* @brief          Start address of ADC hardware units
*/
/** @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage*/
CONST(uint32, ADC_CONST) ADC12BSARV2_BASE_ADDR32[ADC_MAX_HW_UNITS] =
{
#ifdef ADC0_BASEADDR
    ADC0_BASEADDR,
#else
    ((uint32)0x00000000UL),
#endif
#if (ADC_MAX_HW_UNITS > 1U)
#ifdef ADC1_BASEADDR
    ADC1_BASEADDR
#endif
#endif
};

#define ADC_STOP_SEC_CONST_32
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"

#ifdef ADC_DMA_SUPPORTED
#define ADC_START_SEC_VAR_NO_INIT_UNSPECIFIED
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 */
#include "Adc_MemMap.h"
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Internal buffer used by DMA to transfer blocks with gaps
* @violates @ref Adc_Adc12bsarv2_c_REF_10 External linkage
*/
VAR(Adc_ValueGroupType, ADC_VAR) Adc_Adc12bsarv2_aDmaInternalResultBuffer[ADC_MAX_HW_UNITS];
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
/**
* @brief          The array to store the Dma configuration for each Adc hardware unit.
*/
/** @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage*/
VAR(Mcl_DmaTcdAttributesType, AUTOMATIC) Adc_Adc12bsarv2_aDmaTcdConfig[ADC_MAX_HW_UNITS];
/**
* @brief          The array to store the address of TCD which configured for each Adc hardware unit.
*/
/** @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage*/
P2VAR(Mcl_DmaTcdType, AUTOMATIC, ADC_APPL_DATA) Adc_Adc12bsarv2_aTcdAddress[ADC_MAX_HW_UNITS];

