xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
#ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
#if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
/** @violates @ref Adc_Adc12bsarv2_c_REF_15 MISRA 2004 Required Rule 8.7, objects shall be defined at block scope */
static VAR(uint16, ADC_CODE) Adc_Adc12bsarv2_au16DraftBufferDMA[2];
#endif
#endif

#define ADC_STOP_SEC_VAR_NO_INIT_UNSPECIFIED
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"
#endif /* ADC_DMA_SUPPORTED */

#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"

#if (ADC_DUAL_CLOCK_MODE == STD_ON) && (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF)
/**
* @brief          Clock mode in use
*/
extern VAR(Adc_DualClockModeType, AUTOMATIC) Adc_eClockMode;
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) && (ADC_SET_ADC_CONV_TIME_ONCE == STD_OFF) */

#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"
/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
#define ADC_START_SEC_CODE
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_InitUnitHardware
(
    VAR(Adc_HwUnitType,AUTOMATIC) Unit,
    P2CONST(Adc_Adc12bsarv2_HwUnitConfigurationType, AUTOMATIC, ADC_APPL_CONST) pConfigPtr
);

#if (ADC_DEINIT_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DeInitHardware
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
);
#endif

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_StopConversionCheckTimeout
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(uint32, AUTOMATIC) u32Timeout
);
#endif

#ifdef ADC_DMA_SUPPORTED
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StartDmaOperation
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(uint8, AUTOMATIC) u8NumChannel
);
#endif /* ADC_DMA_SUPPORTED */

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
/**
* @brief          Initializes the ADC hardware.
* @details        Initializes the ADC hardware as per configuration.
*
* @param[in]      Unit         The hardware Unit.
* @param[in]      pConfigPtr   Pointer to the hardware configuration structure to be used.
*
* @return         void
*
* @pre            Driver must be initialized.
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_InitUnitHardware
(
    VAR(Adc_HwUnitType,AUTOMATIC) Unit,
    P2CONST(Adc_Adc12bsarv2_HwUnitConfigurationType, AUTOMATIC, ADC_APPL_CONST) pConfigPtr
)
{
    /* Hardware index in the structure*/
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = (Adc_HwUnitType)0;

    /* Counter for SC1 registers */
    VAR(uint8, AUTOMATIC) u8SC1n = 0U;

    /* Get the logical id of hardware Unit*/
    HwIndex = Adc_pCfgPtr->Misc.aHwLogicalId[Unit];

    /* Disable ADC hardware units */
    for (u8SC1n = 0U; u8SC1n < ADC_NUM_SC1n_REGISTER; u8SC1n++)
    {
        /* Clear conversion complete flag (0b) and disable input channel selection (11111b) in SC1 registers*/
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SC1n), ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
    }

    /* Initialize ADC registers as the configuration */

    /* Configuration for clock divide, conversion mode and input clock selection */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    REG_WRITE32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), pConfigPtr[HwIndex].u32AdcCfg1Register);

#if (STD_ON == ADC_SET_ADC_CONV_TIME_ONCE)
    /* Sample time duration configuration */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), pConfigPtr[HwIndex].u32AdcCfg2Register);

    /* Default: Oneshot conversion, enable hardware average function */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), pConfigPtr[HwIndex].u32AdcSc3Register);

#else
    /* Disable hardware average function */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), pConfigPtr[HwIndex].u32AdcSc3Register & (~ADC12BSARV2_SC3_AVG_MASK_U32));

#endif
    /* Default: enable hardware trigger
     * Voltage reference selection as user configuration
     */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    REG_WRITE32(ADC12BSARV2_SC2_REG_ADDR32(Unit), pConfigPtr[HwIndex].u32AdcSc2Register);

