xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
    /* Reset compare value registers */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CVn_REG_ADDR32(Unit, (uint32)0), ADC12BSARV2_CV_RESET_VALUE_U32);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CVn_REG_ADDR32(Unit, (uint32)1), ADC12BSARV2_CV_RESET_VALUE_U32);

    /* Clear user offset register value */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    REG_WRITE32(ADC12BSARV2_USR_OFS_REG_ADDR32(Unit), (ADC12BSARV2_USR_OFS_U32 & (uint32)(pConfigPtr[HwIndex].u32AdcOfsRegister)));

    /* Initialize the PRESCALER and MULT settings of the associated PDB unit */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    Adc_Pdb_Init(Unit, pConfigPtr[HwIndex].u32AdcPdbClockSettings);
}

#if (ADC_DEINIT_API == STD_ON)
/**
* @brief          This function deinitializes the ADC hardware.
*
* @param[in]      Unit      The hardware Unit.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DeInitHardware
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* Counter for SC1 registers */
    VAR(uint8, AUTOMATIC) u8SC1n = 0U;

    /* Disable ADC hardware unit */
    for (u8SC1n = 0U; u8SC1n < ADC_NUM_SC1n_REGISTER; u8SC1n++)
    {
        /* Clear conversion complete flag (0b) and disable input channel selection (11111b) in SC1 registers*/
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SC1n), (ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32));
    }

    /* Reset ADC registers to default value */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_RESET_VALUE_U32);

    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), ADC12BSARV2_CFG2_RESET_VALUE_U32);

    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_SC2_REG_ADDR32(Unit), ADC12BSARV2_SC2_RESET_VALUE_U32);

    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_RESET_VALUE_U32);

    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CVn_REG_ADDR32(Unit, (uint32)0), ADC12BSARV2_CV_RESET_VALUE_U32);

    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CVn_REG_ADDR32(Unit, (uint32)1), ADC12BSARV2_CV_RESET_VALUE_U32);

#ifdef ADC_DMA_SUPPORTED
    if((uint8)ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
    {
        /* Disable DMA interrupt */
        Mcl_DmaDisableHwRequest((Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit]);
    #if (MCL_DMA_NOTIFICATION_SUPPORTED == STD_ON)
        /* Disable DMA notification */
        Mcl_DmaDisableNotification((Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit]);
    #endif
    }
#endif /* ifdef ADC_DMA_SUPPORTED */
}
#endif /* ADC_DEINIT_API == STD_ON */

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
/**
* @brief          This function stops the current conversion.
* @details        This function stops the current conversion and checks if the hardware has responded to the command.
*
* @param[in]      Unit           The hardware Unit.
* @param[in]      Group          The group id.
* @param[in]      u32Timeout     Time for conversion is aborted.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            If the conversion has stopped as expected.
* @retval         E_NOT_OK        In case of timeout while waiting for adc hardware to stop a conversion.
*
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_StopConversionCheckTimeout
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(uint32, AUTOMATIC) u32Timeout
)
{
    VAR(uint8, AUTOMATIC) u8SCRegister;

    /* Stop PDB hardware trigger unit */
    Adc_Pdb_StopConversion(Unit);

    /* Check if ADC is in continuous mode */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if(((uint8)STD_ON == Adc_pCfgPtr->pGroups[Group].u8AdcWithoutInterrupt) && (ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode))
    {
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_03();
        /* Set to Oneshot mode */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_BIT_CLEAR32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_CONTINUOUS_U32);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_03();
    }

    /* Check all of SC1 register disabled */
    for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /* Stop conversion in SC1n register */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
        /* Wait until conversion is aborted */
        /* Because some channels in chain are not converted yet */
        /* ADC235, ADC068 */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        while(((REG_READ32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister)) & ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32) != ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32) && \
              (u32Timeout > (uint32)0U) \
             )
        {
            u32Timeout--;
        }
        
