xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
        if((uint32)0UL == u32Timeout)
        {
#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF)
            if((uint32)STD_ON == Adc_E_TimeoutCfg.state)
            {
                /* Report production error and return from function. */
               (void) Dem_SetEventStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_FAILED);
            }
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_4 Return statement before end of function. */
            return (Std_ReturnType) E_NOT_OK;            
        }
    }
    return (Std_ReturnType) E_OK;
}
#endif /* ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)) */

#ifdef ADC_DMA_SUPPORTED
/**
* @brief          This function programs the DMA transfers involved in the ADC conversion process.
* @details        This function should be called with the ADC Unit on standby (no ADC interruptions
*                 allowed because its code is not protected by critical regions) - no conversions must
*                 be running.
*
* @param[in]      Unit            ADC hardware unit
* @param[in]      Group           Group to be converted
* @param[in]      pGroupPtr       Pointer of group configuration
* @param[in]      u8NumChannel    Number of channels in group
*
* @return         void
*
* @pre ADC Unit is not running anything.
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StartDmaOperation
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(uint8, AUTOMATIC) u8NumChannel
)
{
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pResult = NULL_PTR;
    P2CONST(Mcl_DmaTcdAttributesType, AUTOMATIC, ADC_APPL_CONST) pDmaConfig = NULL_PTR;
    VAR(uint32, AUTOMATIC) u32SourceOffset;
    VAR(uint32, AUTOMATIC) u32DestAddr;
    VAR(uint32, AUTOMATIC) u32Iter;
    VAR(uint16, AUTOMATIC) u16DestNextOffset;
    VAR(uint8, AUTOMATIC) u8DmaTcdFlags;
#if ((STD_ON == ADC_OPTIMIZE_ONESHOT_HW_TRIGGER) || (ADC_ENABLE_DOUBLE_BUFFERING == STD_ON))
    VAR(sint32, AUTOMATIC) s32DmaTcdDlast = (sint32) 0;
    VAR(sint32, AUTOMATIC) s32DmaTcdSlast = (sint32) 0;
#endif /* ((STD_ON == ADC_OPTIMIZE_ONESHOT_HW_TRIGGER) || (ADC_ENABLE_DOUBLE_BUFFERING == STD_ON)) */
#ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
#if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
    VAR(Mcl_DmaTcdAttributesType, AUTOMATIC) DmaTcdConfig;
    P2VAR(Mcl_DmaTcdType, AUTOMATIC, ADC_APPL_DATA) pTcdAddress;
    VAR(Mcl_ChannelType, AUTOMATIC) DmaLinkChannel = 255U; /* Invalid DMA channel*/
#endif
#endif
    VAR(Mcl_ChannelType, AUTOMATIC) DmaChannel;

    if ((uint8)STD_ON == Adc_pCfgPtr->Misc.au8Adc_HwUnit[Unit])
    {
        DmaChannel = (Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit];
        /* Disable DMA interrupt */
        Mcl_DmaDisableHwRequest(DmaChannel);
#if (MCL_DMA_NOTIFICATION_SUPPORTED == STD_ON)
        Mcl_DmaDisableNotification(DmaChannel);
#endif
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        pResult = pGroupPtr->pResultsBufferPtr[Group] + Adc_aGroupStatus[Group].ResultIndex;
#if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING)
        if ((boolean) TRUE == pGroupPtr->bAdcDoubleBuffering)
        {
        #ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
        #if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
            if (u8NumChannel > 1U)
            {
                u32SourceOffset = (uint32) DMA_OFFSET_32_BITS;
                /** Compiler_Warning: It is intended for the address of the element to be stored in another non pointer element. */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                u32DestAddr = (uint32)(pResult);
                u32Iter = u8NumChannel;
                u16DestNextOffset = (uint16)((pGroupPtr->NumSamples) << (uint16)1); /* use a << 1 instead of a*2*/
                u8DmaTcdFlags = 0U;
                /** @violates @ref Adc_Adc12bsarv2_c_REF_6 cast from unsigned int to signed int */
                s32DmaTcdSlast = -(sint32)((uint32)u8NumChannel << 2U); /* use a<<2 instead of a*4*/
                /** @violates @ref Adc_Adc12bsarv2_c_REF_6 cast from unsigned int to signed int */
                s32DmaTcdDlast = -(sint32)((((uint32)pGroupPtr->NumSamples*(uint32)u8NumChannel)-1U)<<1); /* use a << 1 instead of a*2*/
                /* Caculate TCD config for DMA channel linking */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                DmaTcdConfig.u32saddr = (uint32) &Adc_Adc12bsarv2_au16DraftBufferDMA[0];
                DmaTcdConfig.u32ssize = (uint32) DMA_SIZE_2BYTES;
                DmaTcdConfig.u32dsize = (uint32) DMA_SIZE_2BYTES;
                DmaTcdConfig.u32soff = (uint32) 0;
                DmaTcdConfig.u32num_bytes = 2UL;
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                DmaTcdConfig.u32daddr = (uint32) &Adc_Adc12bsarv2_au16DraftBufferDMA[1];
                DmaTcdConfig.u32iter = (uint32) pGroupPtr->NumSamples;
                DmaTcdConfig.u32doff = (uint32) 0;
                DmaTcdConfig.u32smod = (uint32) 0;
                DmaTcdConfig.u32dmod = (uint32) 0;
                
                DmaLinkChannel=(Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaDoubleBuffer[Unit];
                pTcdAddress = Mcl_DmaGetChannelTcdAddress(DmaLinkChannel);
                /** @violates @ref Adc_Adc12bsarv2_c_REF_16 It is needed for calculation value of go back space for source address.*/
                Mcl_DmaConfigTcd(pTcdAddress, &DmaTcdConfig);
                if ((boolean) TRUE == pGroupPtr->bHalfInterrupt)
                {
                    Mcl_DmaTcdSetFlags(pTcdAddress, DMA_TCD_INT_MAJOR_U8 | DMA_TCD_INT_HALF_U8);
                }
                else
                {
                    Mcl_DmaTcdSetFlags(pTcdAddress, DMA_TCD_INT_MAJOR_U8 );
                }
                
