xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
            }
            else
        #endif
        #endif
            {
                u32SourceOffset = (uint32) 0;
                /** Compiler_Warning: It is intended for the address of the element to be stored in another non pointer element. */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                u32DestAddr = (uint32)(pResult);
                u32Iter = (uint32) pGroupPtr->NumSamples;
                u16DestNextOffset = 2U;
                if ((boolean) TRUE == pGroupPtr->bHalfInterrupt)
                {
                    u8DmaTcdFlags = DMA_TCD_DISABLE_REQ_U8 | DMA_TCD_INT_MAJOR_U8 | DMA_TCD_INT_HALF_U8;
                }
                else
                {
                    u8DmaTcdFlags = DMA_TCD_DISABLE_REQ_U8| DMA_TCD_INT_MAJOR_U8;
                }
                
                s32DmaTcdSlast = (sint32) 0;
                /** @violates @ref Adc_Adc12bsarv2_c_REF_6 cast from unsigned int to signed int */
                s32DmaTcdDlast = -(sint32)((uint32)((uint32)pGroupPtr->NumSamples << 1U)); /* use a << 1 instead of a*2*/
            }
        }
        else
#endif /* (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING) */
        {
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
            if ((boolean)TRUE == pGroupPtr->bAdcGroupLimitcheck)
            {
                u32SourceOffset = (uint32) 0;
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                u32DestAddr = (uint32)(&(Adc_Adc12bsarv2_aDmaInternalResultBuffer[Unit]));
                u32Iter = (uint32) 1;
                u16DestNextOffset = 0U;
            }
            else
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
            {
                u32SourceOffset = (uint32) DMA_OFFSET_32_BITS;
                /** Compiler_Warning: It is intended for the address of the element to be stored in another non pointer element. */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                u32DestAddr = (uint32)(pResult);
                u32Iter = (uint32) u8NumChannel;
                u16DestNextOffset = (uint16)((pGroupPtr->NumSamples) << (uint16)1);
            }
            u8DmaTcdFlags = DMA_TCD_DISABLE_REQ_U8 | DMA_TCD_INT_MAJOR_U8;
        }
        /* Update the Tcd configuration */
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32saddr = (uint32) ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)0);
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32ssize = (uint32) DMA_SIZE_2BYTES;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32dsize = (uint32) DMA_SIZE_2BYTES;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32soff = (uint32) u32SourceOffset;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32num_bytes = 2UL;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32daddr = (uint32) u32DestAddr;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32iter = (uint32) u32Iter;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32doff = (uint32) u16DestNextOffset;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32smod = (uint32) 0;
        Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32dmod = (uint32) 0;
        pDmaConfig = &(Adc_Adc12bsarv2_aDmaTcdConfig[Unit]);

        Adc_Adc12bsarv2_aTcdAddress[Unit] = Mcl_DmaGetChannelTcdAddress(DmaChannel);
    #ifdef ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL
    #if (STD_ON == ADC_DOUBLE_BUFFERING_MORE_THAN_ONE_CHANNEL)
        if (((boolean) TRUE == pGroupPtr->bAdcDoubleBuffering)&&(u8NumChannel > 1U))
        {
            Mcl_DmaConfigLinkedChannel(DmaChannel,pDmaConfig,DmaLinkChannel);
        }
        else
    #endif
    #endif
        {
            Mcl_DmaConfigTcd(Adc_Adc12bsarv2_aTcdAddress[Unit], pDmaConfig);
            Mcl_DmaTcdSetFlags(Adc_Adc12bsarv2_aTcdAddress[Unit], u8DmaTcdFlags);
        }

#if (STD_ON == ADC_OPTIMIZE_ONESHOT_HW_TRIGGER)
        /** @violates @ref Adc_Adc12bsarv2_c_REF_6 cast from unsigned int to signed int */
        s32DmaTcdSlast = -(sint32)((uint32)u8NumChannel << 2U);
        /** @violates @ref Adc_Adc12bsarv2_c_REF_6 cast from unsigned int to signed int */
        s32DmaTcdDlast = -(sint32)((uint32)u8NumChannel << 1U);
#endif /* (STD_ON == ADC_OPTIMIZE_ONESHOT_HW_TRIGGER) */

#if ((STD_ON == ADC_OPTIMIZE_ONESHOT_HW_TRIGGER) || (ADC_ENABLE_DOUBLE_BUFFERING == STD_ON))
        Mcl_DmaTcdSetSlast(Adc_Adc12bsarv2_aTcdAddress[Unit], s32DmaTcdSlast);
        Mcl_DmaTcdSetDlast(Adc_Adc12bsarv2_aTcdAddress[Unit], s32DmaTcdDlast);
#endif /* ((STD_ON == ADC_OPTIMIZE_ONESHOT_HW_TRIGGER) || (ADC_ENABLE_DOUBLE_BUFFERING == STD_ON)) */

        /* Start the DMA channel0 */
        Mcl_DmaEnableHwRequest(DmaChannel);
    }
}
#endif /* ADC_DMA_SUPPORTED */

/*==================================================================================================
                                       GLOBAL FUNCTIONS
==================================================================================================*/
/**
* @brief          This function initializes the ADC hardware module, and the ADC driver.
* @details        This function initializes the ADC hardware module, and the ADC driver.
*
* @param[in]      pCfgPtr      Configuration data pointer.
*
* @return         void
*
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_Init
(
    P2CONST(Adc_ConfigType, AUTOMATIC, ADC_APPL_CONST) pCfgPtr
)
{
    /* Hardware Unit index */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = (Adc_HwUnitType)0;

    /* ADC hardware unit config pointer */
    P2CONST(Adc_Adc12bsarv2_HwUnitConfigurationType, AUTOMATIC, ADC_APPL_CONST) pConfigPtr = pCfgPtr->pAdc;

    /* Initialize Unit Status structures */
    /* Initialize for each ADC hardware unit (eg: ADC0, ADC1...) */
    for(Unit = (Adc_HwUnitType)0; Unit < (Adc_HwUnitType)ADC_MAX_HW_UNITS; Unit++)
    {
        /* Check if unit is available */
        if((uint8)STD_ON == ADC_HW_UNITS(Unit))
        {
            Adc_Adc12bsarv2_InitUnitHardware(Unit, pConfigPtr);
        }
    }
}

#if (ADC_DEINIT_API == STD_ON)
/**
* @brief          This function deinitializes the ADC driver, and the ADC hardware.
* @details        This function deinitializes the ADC driver, and ensures that the ADC hardware
*                 will be in the power on after reset state.
*
* @return         void
*
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DeInit(void)
{
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    VAR(Adc_GroupType,AUTOMATIC) GroupIdx = 0U;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U; /* Hardware Unit index */

