xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
    /* De-initialize each ADC hardware unit */
    for(;Unit<(Adc_HwUnitType)ADC_MAX_HW_UNITS;Unit++)
    {
        if((uint8)STD_ON == ADC_HW_UNITS(Unit))
        {
            Adc_Adc12bsarv2_DeInitHardware(Unit);
        }
    }

    /* De-initialize PDB hardware trigger unit */
    Adc_Pdb_DeInit();

    /* Disable notification of all available groups */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    for(GroupIdx=(Adc_GroupType)0U;GroupIdx<(Adc_GroupType)ADC_MAX_GROUPS;GroupIdx++)
    {
        Adc_aGroupStatus[GroupIdx].eNotification = ADC_NOTIFICATION_DISABLED;
    }
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

}
#endif /* #if (ADC_DEINIT_API == STD_ON) */

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
/**
* @brief          This function stops the current conversion of a group.
* @details        This function stops the current conversion of a group.
*
* @param[in]      Unit      The hardware Unit.
* @param[in]      Group     The group id.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            If the conversion has stopped as expected.
* @retval         E_NOT_OK        In case of timeout while waiting for adc hardware to stop a conversion.
*
*/
/** @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage*/
FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_StopCurrentConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(volatile uint32, AUTOMATIC) u32Timeout = ADC_TIMEOUT_COUNTER;
    /* Variable for checking timeout status */
    VAR(Std_ReturnType, AUTOMATIC) Test = (Std_ReturnType)E_OK;

    /* Counter for SC registers */
    VAR(uint8, AUTOMATIC) u8SCRegister;

    /* Disable Adc hardware unit and clear all of COCO flag by reading Rn register */
    for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)u8SCRegister));
    }

    /* Disable DMA requests and notifications */
#ifdef ADC_DMA_SUPPORTED
    if((uint8)ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
    {
        Mcl_DmaDisableHwRequest((Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit]);
    #if (MCL_DMA_NOTIFICATION_SUPPORTED == STD_ON)
        Mcl_DmaDisableNotification((Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit]);
    #endif
    }
#endif /* ADC_DMA_SUPPORTED */
    MCAL_FAULT_INJECTION_POINT(ADC_FIP_0_UPDATE_VARIABLE_TIMEOUT);
    /* Reset current channel status to 0 */
    Adc_aGroupStatus[Group].CurrentChannel = 0U;

    /* Stop the conversion and abort the current group conversion */
#if (ADC_BYPASS_CONSISTENCY_LOOP == STD_ON)
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if((uint8)STD_OFF == Adc_pCfgPtr->pGroups[Group].u8AdcWithoutInterrupt)
    {
        Test = Adc_Adc12bsarv2_StopConversionCheckTimeout(Unit, Group, u32Timeout);
    }
    else
    {
        /* If group is continuous and configured without interrupts, clear the CONTINUOUS bit */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        if (ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode)
        {
#ifdef ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED
            Adc_Pdb_StopConversion(Unit);
#endif /* ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED */
        }
    }
#else /* (ADC_BYPASS_CONSISTENCY_LOOP == STD_ON) */
    Test = Adc_Adc12bsarv2_StopConversionCheckTimeout(Unit, Group, u32Timeout);
#endif /* (ADC_BYPASS_CONSISTENCY_LOOP == STD_OFF) */

    return Test;
}
#endif

#if (ADC_HW_TRIGGER_API == STD_ON)
/**
* @brief          This function performs starting a hardware trigger conversion.
* @details        This function performs starting a hardware trigger conversion.
*
* @param[in]      Unit        The hardware Unit.
* @param[in]      Group       The group of which conversion will be started.
*
* @return         void
* @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StartHwTrigConversion
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(uint8, AUTOMATIC) u8NumChannel;
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);

    /* Calculate the number of channels for current configuration */
#if (ADC_SETCHANNEL_API == STD_ON)
    u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(Adc_aRuntimeGroupChannel[Group].ChannelCount);
#else
    u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(pGroupPtr->AssignedChannelCount);
#endif

    /* If it is the first group, u8Sc1Used is assigned as the number channels of group */
    if(0U == Adc_aUnitStatus[Unit].u8Sc1Used)
    {
        Adc_aUnitStatus[Unit].u8Sc1Used = u8NumChannel;
    }
    Adc_aGroupStatus[Group].CurrentChannel = 0U;

#ifdef ADC_DMA_SUPPORTED
    if (ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
    {
        if((uint8)STD_OFF == pGroupPtr->u8AdcWithoutInterrupt)
        {
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_04();
            /* Enable DMA interrupt incase of Group configured with interrupt */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_BIT_SET32(ADC12BSARV2_SC2_REG_ADDR32(Unit), ADC12BSARV2_SC2_DMA_EN_U32);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_04();

