xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
            /* Setting for DMA transfer */
            Adc_Adc12bsarv2_StartDmaOperation(Unit, Group, pGroupPtr, u8NumChannel);
        }

        /* Ensure that PDB does not run when ADC configured */
        Adc_Pdb_StopConversion(Unit);

        /* Setting for ADC in case of DMA transfer was selected, in the first time DMA should not be re-configured */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_Adc12bsarv2_ConfigureDmaPartialConversion(Unit, Group, pGroupPtr, (Adc_HwTriggerTimerType)pGroupPtr->pHwResource[0], u8NumChannel, (boolean)FALSE);
    }
    else
#endif /* ADC_DMA_SUPPORTED */
    {
        /* Setting for ADC hardware in case of DMA transfer was not selected */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, pGroupPtr, pGroupPtr->pHwResource[0], u8NumChannel);
    }
}
#endif

#if (ADC_READ_GROUP_API == STD_ON)
/**
* @brief          This function reads the converted data for the requested group.
* @details        Reads the converted data for the requested group.
*
* @param[in]      Group           The group number.
* @param[in]      pDataPtr        Pointer to a buffer which will be filled by the
*                                 conversion results.
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successfull read of the converted data.
* @retval         E_NOT_OK        In case of an ongoing conversion.
*
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_ReadGroup
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pDataPtr,
    P2VAR(boolean, AUTOMATIC, ADC_APPL_DATA) pFlag
)
{
    VAR(Std_ReturnType, AUTOMATIC) ReadGroupRet = (Std_ReturnType)E_OK;
    VAR(Adc_ChannelIndexType, AUTOMATIC) ChannelCount;
    VAR(Adc_ChannelIndexType, AUTOMATIC) Index;
    /* Pointer to AdcGroup */
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr = NULL_PTR;

    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);

#if (ADC_SETCHANNEL_API == STD_ON)
    ChannelCount = Adc_aRuntimeGroupChannel[Group].ChannelCount;
#else
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    ChannelCount = pGroupPtr->AssignedChannelCount;
#endif

    /* If the group is configured for without interrupts*/
    if((uint8)STD_ON == pGroupPtr->u8AdcWithoutInterrupt)
    {
        VAR(uint32, AUTOMATIC) u32HsValue;
        VAR(uint16, AUTOMATIC) u16R0Value;
        VAR(Adc_HwUnitType, AUTOMATIC) Unit;
        VAR(Adc_HwUnitType, AUTOMATIC) HwIndex;
        VAR(uint32, AUTOMATIC) u32AdcDataMask;
#if (STD_ON == ADC_HW_TRIGGER_API)
        VAR(Adc_GroupType, AUTOMATIC) GroupHWNormalQueue;
#endif
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        VAR(Adc_ChannelType, AUTOMATIC) ChIndex;
        /* Flag to set if ADC results are in the selected range */
        VAR(boolean, AUTOMATIC) bWriteFlag = (boolean)TRUE;
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */

        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Unit = Adc_pCfgPtr->pGroups[Group].HwUnit;
    #if (STD_ON == ADC_HW_TRIGGER_API)
        GroupHWNormalQueue = Adc_aUnitStatus[Unit].HwNormalQueue[0];
        if ((Group == Adc_aUnitStatus[Unit].SwNormalQueue[0]) || (Group == GroupHWNormalQueue))
    #else
        if (Group == Adc_aUnitStatus[Unit].SwNormalQueue[0])
    #endif
        {
            /*Checking conversion is completed for all channels*/
            for(Index = 0U; Index < ChannelCount; Index++)
            {
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                u32HsValue = REG_READ32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)Index));
                if(0UL == (u32HsValue & ADC12BSARV2_SC1n_CONV_COMPLETE_U32))
                {
                    /** @violates @ref Adc_Adc12bsarv2_c_REF_4 Return statement before end of function. */
                    return (Std_ReturnType)E_NOT_OK;
                }
            }
        }
        else
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_4 Return statement before end of function. */
            return (Std_ReturnType)E_NOT_OK;
        }
        /* Get the logical id from hardware Unit*/
        HwIndex = Adc_pCfgPtr->Misc.aHwLogicalId[Unit];
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        u32AdcDataMask = Adc_pCfgPtr->pAdc[HwIndex].u32AdcDataMask;
#if (ADC_ENABLE_LIMIT_CHECK == STD_OFF)
        (*pFlag) = (boolean)TRUE;
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_OFF) */

        for(Index = 0U; Index < ChannelCount; Index++)
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            u16R0Value = (uint16)(REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)Index)));

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
            /* there is only one channel in the group - the first channel */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            ChIndex = pGroupPtr->pAssignment[0];
            if ((boolean)TRUE == pGroupPtr->bAdcGroupLimitcheck)
            {
                /* ADC446, ADC447 */
                (*pFlag) = (boolean)Adc_CheckConversionValuesInRange(u16R0Value, Unit, ChIndex);
                if ((boolean)FALSE == (*pFlag))
                {
                    /* ADC448, ADC449, ADC450 */
                    ReadGroupRet = (Std_ReturnType)E_NOT_OK;
                    bWriteFlag = (boolean)FALSE;
                }
            }
            if((boolean)TRUE == bWriteFlag)
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
            {
                /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
                pDataPtr[Index] = (uint16)(u16R0Value & u32AdcDataMask);
            }
        }
    }
    /* If the group is configured for with interrupts*/
    else
    {
        P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pResultPtr = NULL_PTR;
        VAR(uint32, AUTOMATIC) u32DestOffset = 0UL;
        VAR(Adc_StreamNumSampleType, AUTOMATIC) ResultIndex = (Adc_StreamNumSampleType)0;

