xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
        if (ADC_BUSY == Adc_aGroupStatus[Group].eConversion)
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_4 Return statement before end of function. */
            return (Std_ReturnType)E_NOT_OK;
        }

        /* Get index of last completed sample */
        ResultIndex = Adc_aGroupStatus[Group].ResultIndex - (Adc_StreamNumSampleType)1;
        if ((Adc_StreamNumSampleType)0 == Adc_aGroupStatus[Group].ResultIndex)
        {
            ResultIndex = pGroupPtr->NumSamples - (Adc_StreamNumSampleType)1;
        }

        
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_27();
        /**
        * @violates @ref Adc_Adc12bsarv2_c_REF_5 Cast from pointer to pointer.
        * @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic
        */
        pResultPtr = (Adc_ValueGroupType *)(pGroupPtr->pResultsBufferPtr[Group]+ResultIndex);
        u32DestOffset = pGroupPtr->NumSamples;

        /* Copy results of last conversion from streaming buffer to internal buffer */
        for(Index = 0U; Index < ChannelCount; Index++)
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            pDataPtr[Index] = (*pResultPtr);
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            pResultPtr += u32DestOffset;
        }
        
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_27();
    }

    return(ReadGroupRet);
}
#endif /* (ADC_READ_GROUP_API == STD_ON) */

#if (ADC_HW_TRIGGER_API == STD_ON)
/**
* @brief          This function enables the hardware triggers for the specified group.
* @details        This function enables the hardware triggers for the specified group.
*
* @param[in]      Group           The group for which the hardware triggers will be enabled.
* @param[in]      Unit            The hardware Unit. (on other platforms there are more hw units)
*
* @return         void
*
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_EnableHardwareTrigger
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(uint8, AUTOMATIC) u8SCRegister;
#if (STD_OFF == ADC_SET_ADC_CONV_TIME_ONCE)
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr; /* Pointer to AdcGroup */

    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);
#endif

    Adc_aGroupStatus[Group].ResultIndex = 0U;

    /* Clear all of COCO flag by reading Rn registers */
    for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)u8SCRegister));
    }

#if (STD_OFF == ADC_SET_ADC_CONV_TIME_ONCE)
    /* If conversion time once disabled, either normal or alternate clock mode can be configured at runtime */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_05();
    #if (ADC_DUAL_CLOCK_MODE == STD_ON)
    if(ADC_ALTERNATE == Adc_eClockMode)
    {
        /* Set clock division for alternate clock mode */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32, (pGroupPtr->u32ClockDivideSelectAlternate & ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32));

        /* Setting for alternate conversion timing in CFG2 and SC3 register */
        /* Set alternate sample time */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), (pGroupPtr->u32SampleTimeAlternate & ADC12BSARV2_CFG2_SAMPLE_TIME_MASK_U32));

        /* Enable hardware average and set average samples */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_AVG_MASK_U32, (pGroupPtr->u32AvgSelectAlternate & ADC12BSARV2_SC3_AVG_MASK_U32));
    }
    else
    #endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */
    {
        /* Set clock division for normal clock mode */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32, (pGroupPtr->u32ClockDivideSelect & ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32));

        /* Setting for conversion timing in CFG2 and SC3 register */
        /* Set normal sample time */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), (pGroupPtr->u32SampleTime & ADC12BSARV2_CFG2_SAMPLE_TIME_MASK_U32));

        /* Enable hardware average and set average samples */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_AVG_MASK_U32, (pGroupPtr->u32AvgSelect & ADC12BSARV2_SC3_AVG_MASK_U32));
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_05();
#endif /*end (STD_OFF == ADC_SET_ADC_CONV_TIME_ONCE)*/

