xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
    Adc_Adc12bsarv2_StartHwTrigConversion(Unit, Group);

}

/**
* @brief          This function disables the hardware triggers for the specified group.
* @details        This function disables the hardware triggers for the specified group.
*
* @param[in]      Group           The group for which the hardware triggers will be enabled.
* @param[in]      Unit            The hardware Unit. (on other platforms there are more hw units)
*
* @return         void
*
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_DisableHardwareTrigger
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(uint8, AUTOMATIC) u8SCRegister;


    (void)Group;
#ifdef ADC_DMA_SUPPORTED
    /* Disable DMA */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    if (ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
    {
        if ((uint8)STD_ON == Adc_pCfgPtr->Misc.au8Adc_HwUnit[Unit])
        {
            /* Disable DMA interrupt */
            Mcl_DmaDisableHwRequest((Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit]);
        #if (MCL_DMA_NOTIFICATION_SUPPORTED == STD_ON)
            Mcl_DmaDisableNotification((Mcl_ChannelType)Adc_pCfgPtr->Misc.au8Adc_DmaChannel[Unit]);
        #endif
        }
    }
#endif /* ADC_DMA_SUPPORTED */

    Adc_Pdb_StopConversion(Unit);

    /* Disable Adc hardware unit */
    for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
    }

}
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

/**
* @brief          This function starts the conversion on the specified hardware Unit.
* @details        This function starts the conversion on the specified hardware Unit.
*                 This function should be called with the ADC Unit on standby (no ADC interruptions
*                 allowed because its code is not protected by critical regions) - no conversions must
*                 be running.
*
* @param[in]      Unit            the used hw Unit.
*
* @return         void
*
* @violates @ref Adc_Adc12bsarv2_c_REF_10 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_StartNormalConversion
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr; /* Pointer to AdcGroup */
    VAR(Adc_GroupType, AUTOMATIC) Group = (Adc_GroupType)0; /* Active group in the Queue */
    VAR(uint8, AUTOMATIC) u8SCRegister;
    VAR(uint8, AUTOMATIC) u8NumChannel;

    /* If software normal queue is empty (i.e no conversion requests) then return without any action */
    if ((Adc_QueueIndexType)0 == Adc_aUnitStatus[Unit].SwNormalQueueIndex)
    {
        /** @violates @ref Adc_Adc12bsarv2_c_REF_4 Return statement before end of function. */
        return;
    }

    /* Load the first group in the queue */
    Group = Adc_aUnitStatus[Unit].SwNormalQueue[0];

    /* Load the group configuration */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    pGroupPtr = &(Adc_pCfgPtr->pGroups[Group]);

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    /* Group configured as one-shot mode and limit checking failed then return without any action */
    if(((boolean)TRUE == Adc_aGroupStatus[Group].bLimitCheckFailed) && (ADC_CONV_MODE_ONESHOT == pGroupPtr->eMode))
    {
        /** @violates @ref Adc_Adc12bsarv2_c_REF_4 Return statement before end of function. */
        return;
    }
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

#if (STD_OFF == ADC_SET_ADC_CONV_TIME_ONCE)
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_06();
    /* Check the clock mode (and config if needed) every start conversion if conversion time once is disabled */
    #if (ADC_DUAL_CLOCK_MODE == STD_ON)
    if(ADC_ALTERNATE == Adc_eClockMode)
    {
        /* Clock divide select for alternate mode */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32, (pGroupPtr->u32ClockDivideSelectAlternate & ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32));

        /* Setting for alternate conversion timing in CFG2 and SC3 register */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), (pGroupPtr->u32SampleTimeAlternate & ADC12BSARV2_CFG2_SAMPLE_TIME_MASK_U32));

        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_AVG_MASK_U32, (pGroupPtr->u32AvgSelectAlternate & ADC12BSARV2_SC3_AVG_MASK_U32));
    }
    else
    #endif /* (ADC_DUAL_CLOCK_MODE == STD_ON)*/
    {
        /* Clock divide select for normal mode */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32, (pGroupPtr->u32ClockDivideSelect & ADC12BSARV2_CFG1_CLOCK_DIV_MASK_U32));

        /* Setting for conversion timing in CFG2 and SC3 register */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), (pGroupPtr->u32SampleTime & ADC12BSARV2_CFG2_SAMPLE_TIME_MASK_U32));

        /* Select average samples */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_RMW32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_AVG_MASK_U32, (pGroupPtr->u32AvgSelect & ADC12BSARV2_SC3_AVG_MASK_U32));
    }
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_06();
#endif /*end (STD_OFF == ADC_SET_ADC_CONV_TIME_ONCE)*/

