xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
    /* Reset to start conversion from channel logical index 0 */
    Adc_aGroupStatus[Group].CurrentChannel = 0U;

    /* Calculate the number of channels for current configuration */
#if (ADC_SETCHANNEL_API == STD_ON)
    /* Channel enabled at runtime */
    u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(Adc_aRuntimeGroupChannel[Group].ChannelCount);
#else
    /* Channel enabled from initialzing */
    u8NumChannel = (uint8)ADC_ADC12BSARV2_GET_LEFT_CHANNEL(pGroupPtr->AssignedChannelCount);
#endif

    /* Update u8Sc1Used for the first time */
    if(0U == Adc_aUnitStatus[Unit].u8Sc1Used)
    {
        Adc_aUnitStatus[Unit].u8Sc1Used = u8NumChannel;
    }

#ifdef ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED
    /* If the continuous group is configured without interrupts then PDB will be configured as continuous mode */
    if((ADC_CONV_MODE_CONTINUOUS == pGroupPtr->eMode) && ((uint8)STD_ON == pGroupPtr->u8AdcWithoutInterrupt))
    {
        /* PDB operation in Continuous mode */
        Adc_Pdb_SetPdbMode(Unit, (boolean)TRUE);
    }
    else
    {
        /* PDB operation in One-Shot mode */
        Adc_Pdb_SetPdbMode(Unit, (boolean)FALSE);
    }
#endif /* ADC_CONTINUOUS_NO_INTERRUPT_SUPPORTED */

#ifdef ADC_DMA_SUPPORTED
    if (ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
    {
        /* If the group is configured for with interrupts*/
        if ((uint8)STD_OFF == pGroupPtr->u8AdcWithoutInterrupt)
        {
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_07();
            /* Enable DMA interrupt in case of Group configured with interrupt */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_BIT_SET32(ADC12BSARV2_SC2_REG_ADDR32(Unit), ADC12BSARV2_SC2_DMA_EN_U32);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_07();
            
            /* Setting for DMA transfer */
            Adc_Adc12bsarv2_StartDmaOperation(Unit, Group, pGroupPtr, u8NumChannel);

            /* Ensure that PDB does not run when ADC configured */
            Adc_Pdb_StopConversion(Unit);
        }
            /* Setting for Adc in case of DMA transfer was selected, in the first time DMA should not be re-configured */
            Adc_Adc12bsarv2_ConfigureDmaPartialConversion(Unit, Group, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32, u8NumChannel, (boolean)FALSE);
    }
    else
#endif /* ADC_DMA_SUPPORTED */
    {
        /* Clear all of COCO flag by reading Rn registers */
        for(u8SCRegister = 0U; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)u8SCRegister));
        }
        
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_08();
        /* Enable hardware trigger */
        /* Both software and hardware trigger will be implemented through PDB */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_BIT_SET32(ADC12BSARV2_SC2_REG_ADDR32(Unit), ADC12BSARV2_SC2_ADTRG_HW_U32);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_08();
        
        /* Update group configuration to registers and start conversion */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_Adc12bsarv2_ConfigurePartialConversion(Unit, Group, pGroupPtr, PDB_SOFTWARE_TRIGGER_U32, u8NumChannel);
    }
}

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
/**
* @brief          This function sets the clock prescaler and conversion timing registers.
* @details        This function sets the clock prescaler and conversion timing registers.
*
* @param[in]      eClockMode       ADC_NORMAL, ADC_ALTERNATE.
*
* @return         Std_ReturnType  E_OK or E_NOT_OK.
* @retval         E_OK            In case of successful set mode.
* @retval         E_NOT_OK        In case of unsuccessful set mode.
*
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_Adc12bsarv2_SetClockMode
(
    VAR(Adc_DualClockModeType, AUTOMATIC) eClockMode
)
{
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U; /* Hardware Unit index */
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = 0U; /* Index of hardware Unit */
    P2CONST(Adc_Adc12bsarv2_HwUnitConfigurationType, AUTOMATIC, ADC_APPL_CONST) pUnitConfigPtr; /* Pointer to Hw Unit config */

    for (Unit = 0U; Unit < (Adc_HwUnitType)ADC_MAX_HW_UNITS; Unit++)
    {
        if((uint8)STD_ON == ADC_HW_UNITS(Unit))
        {
            /* Get the logical id of hardware Unit*/
            HwIndex = Adc_pCfgPtr->Misc.aHwLogicalId[Unit];

            /* Pointer for configure clock mode */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            pUnitConfigPtr = &(Adc_pCfgPtr->pAdc[HwIndex]);
            
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_09();
            if ((Adc_DualClockModeType)ADC_NORMAL == eClockMode)
            {
                /* Normal clock mode */
                /* Configure clock divide select and input clock select */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                REG_RMW32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_SET_CLOCKMODE_MASK_U32, (pUnitConfigPtr->u32AdcCfg1Register & ADC12BSARV2_CFG1_SET_CLOCKMODE_MASK_U32));

                /* Sampling time and hardware average configuration */
                #if (STD_ON == ADC_SET_ADC_CONV_TIME_ONCE)
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), pUnitConfigPtr->u32AdcSc3Register);
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), pUnitConfigPtr->u32AdcCfg2Register);
                #endif
            }
            else  /* ADC_ALTERNATE == eClockMode */
            {
                /* Alternate clock mode */
                /* Configure clock divide select and input clock select */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                REG_RMW32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_SET_CLOCKMODE_MASK_U32, (pUnitConfigPtr->u32AdcCfg1RegisterAlternate & ADC12BSARV2_CFG1_SET_CLOCKMODE_MASK_U32));

