xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
                /* Configure clock divide select and input clock select */
                #if (STD_ON == ADC_SET_ADC_CONV_TIME_ONCE)
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), pUnitConfigPtr->u32AdcSc3RegisterAlternate);
                /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
                /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
                REG_WRITE32(ADC12BSARV2_CFG2_REG_ADDR32(Unit), pUnitConfigPtr->u32AdcCfg2RegisterAlternate);
                #endif
            }
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_09();
        }
    }

    return (Std_ReturnType)E_OK;
}
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

#if (ADC_CALIBRATION == STD_ON)
/**
* @brief          Executes high accuracy calibration of a ADC HW Unit.
* @details        This function calibrates the ADC HW Unit and updates calibration related registers
*
* @param[in]      Unit      ADC Unit Id.
* @param[in]      Status    Status of the ADC HW Unit calibration and
*                           list of failed/passed tests.
*
* @return         void
*  @violates @ref Adc_Adc12bsarv2_c_REF_14 Pointer parameter.
*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_Calibrate
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    P2VAR(Adc_CalibrationStatusType , AUTOMATIC, ADC_APPL_DATA) pStatus
)
{
    VAR(volatile uint32, AUTOMATIC) u32Timeout = ADC_TIMEOUT_COUNTER;
    VAR(uint32, AUTOMATIC) u32Sc3Status;
    VAR(uint32, AUTOMATIC) u32Cfg1Status;
    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_10();
    /* Back up SC3 status */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    u32Sc3Status = REG_READ32(ADC12BSARV2_SC3_REG_ADDR32(Unit));
    /* Back up CFG1 status */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    u32Cfg1Status = REG_READ32(ADC12BSARV2_CFG1_REG_ADDR32(Unit));
    /* Clear ADTRG bit to ensure that calibrate success */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_CLEAR32(ADC12BSARV2_SC2_REG_ADDR32(Unit), ADC12BSARV2_SC2_ADTRG_HW_U32);

    /* Set the clock to half the maximum specified frequency */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_SET32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), ADC12BSARV2_CFG1_CLOCK_DIV2_U32);

    /* Write zero to these register: CLPS, CLP3, CLP2, CLP1, CLP0, CLPX, and CLP9 */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLPS_REG_ADDR32(Unit), (uint32)0x0);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLP3_REG_ADDR32(Unit), (uint32)0x0);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLP2_REG_ADDR32(Unit), (uint32)0x0);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLP1_REG_ADDR32(Unit), (uint32)0x0);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLP0_REG_ADDR32(Unit), (uint32)0x0);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLPX_REG_ADDR32(Unit), (uint32)0x0);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CLP9_REG_ADDR32(Unit), (uint32)0x0);

    /* Set hardware averaging to maximum */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_AVGE_EN_U32 | ADC12BSARV2_SC3_AVGS_32_SAMPLES_U32);
    MCAL_FAULT_INJECTION_POINT(ADC_FIP_1_UPDATE_VARIABLE_TIMEOUT);
    /* Start calibration */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_SET32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_CAL_EN_U32);
    pStatus->Adc_UnitSelfTestStatus = (Std_ReturnType) E_OK;

    /* Waiting for calibrate success */
    /* ADC235, ADC068 */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned int to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    while(ADC12BSARV2_SC1n_CONV_COMPLETE_U32 != (REG_READ32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)0)) & ADC12BSARV2_SC1n_CONV_COMPLETE_U32))
    {
        if(u32Timeout > 0UL)
        {
            u32Timeout--;
        }
        else
        {
#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF)
            if((uint32)STD_ON == Adc_E_TimeoutCfg.state)
            {
               (void) Dem_SetEventStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_FAILED);
            }
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
            pStatus->Adc_UnitSelfTestStatus = (Std_ReturnType) E_NOT_OK;
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_BIT_CLEAR32(ADC12BSARV2_SC3_REG_ADDR32(Unit), ADC12BSARV2_SC3_CAL_EN_U32);
            break;
        }
    }

    /* Clear the COCO flag */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    (void)REG_READ32(ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)0));
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_BIT_SET32(ADC12BSARV2_SC2_REG_ADDR32(Unit), ADC12BSARV2_SC2_ADTRG_HW_U32);
    /* Reconfigure for SC3 and CFG1 register */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_SC3_REG_ADDR32(Unit), u32Sc3Status);
    /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
    /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
    REG_WRITE32(ADC12BSARV2_CFG1_REG_ADDR32(Unit), u32Cfg1Status);
    
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_10();

