xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
}
#endif /* ADC_CALIBRATION == STD_ON */

/**
* @brief          Configure channels of a group
* @details        This function configure channels of a group
*                   if number of channels in group excess maximum channels allowed for a conversion,
*                   a part of channels of group (= max allowed channels) will be configured in start conversion in the first time.
*                   the remaining channels of group will be seperated into other parts which are configured and converted in group interrupt.
*
* @param[in]      Unit          ADC Unit Id.
* @param[in]      Group         The group number.
* @param[in]      pGroupPtr     Group config pointer.
* @param[in]      Trigger       PDB trigger.
* @param[in]      u8NumChannel  Number of channels to be configured
*
* @return         void
*  @violates @ref Adc_Adc12bsarv2_c_REF_14 Pointer parameter.
*/

/** @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage*/
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_ConfigurePartialConversion
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger,
    CONST(uint8, AUTOMATIC) u8NumChannel
)
{
    VAR(Adc_ChannelIndexType, AUTOMATIC) CurrentChannel;
    VAR(Adc_ChannelType, AUTOMATIC) Channel;
    VAR(Adc_ChannelType, AUTOMATIC) HwChannel;
    VAR(uint8, AUTOMATIC) u8SCRegister;
    VAR(uint32, AUTOMATIC) u32RegValue;
    P2CONST(Adc_GroupDefType, AUTOMATIC, ADC_APPL_CONST) pChannel = NULL_PTR;

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Get status of channels are changed at runtime */
    VAR(uint32, AUTOMATIC) u32TempMask = Adc_aRuntimeGroupChannel[Group].u32Mask;
#endif

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_00();
    /* Next channel will be converted */
    CurrentChannel = Adc_aGroupStatus[Group].CurrentChannel;

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Get configured channels */
    /* At runtime */
    pChannel = Adc_aRuntimeGroupChannel[Group].pChannel;
#else
    /* Pre-configuration */
    pChannel = pGroupPtr->pAssignment;
#endif

    /* Configure channels from current to (last channel - 1) */
    for(u8SCRegister = 0U; u8SCRegister < (u8NumChannel - 1U); u8SCRegister++)
    {
        /* Logical channel ID */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Channel = pChannel[(CurrentChannel + u8SCRegister)];

#if (ADC_SETCHANNEL_API == STD_ON)
        /* Channel was changed? */
        if (1U == (u32TempMask & 1U))
#endif
        {
            /* Hardware channel ID */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            HwChannel = Adc_pCfgPtr->pChannels[Unit][Channel].ChId;

            /* Disable interrupt all channels not the last channel */
            u32RegValue = ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | (HwChannel & ADC12BSARV2_ADCH_MASK_U32);
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), u32RegValue);
        }
#if (ADC_SETCHANNEL_API == STD_ON)
        u32TempMask = u32TempMask >> 1U;
        /* There are no channels changed then break out the loop */
        if (0U == u32TempMask)
        {
            break;
        }
#endif
    }

    /* Configure last channel */
#if (ADC_SETCHANNEL_API == STD_ON)
    /* Last channel was changed? */
    if (1U == (u32TempMask & 1U))
#endif
    {
        /* Get channel ID */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        Channel = pChannel[(CurrentChannel + u8SCRegister)];
        /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
        HwChannel = Adc_pCfgPtr->pChannels[Unit][Channel].ChId;

        /* In case of group is configured with interrupt, the complete int bit of the last channel must be enabled */
        if((uint8)STD_OFF == pGroupPtr->u8AdcWithoutInterrupt)
        {
            u32RegValue = ADC12BSARV2_CONV_COMPLETE_INT_EN_U32 | (HwChannel & ADC12BSARV2_ADCH_MASK_U32);
        }
        else
        {
            u32RegValue = ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | (HwChannel & ADC12BSARV2_ADCH_MASK_U32);
        }

        /* Update register */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), u32RegValue);
    }

#if ((ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) || (ADC_SETCHANNEL_API == STD_ON))
    /* Disable others SC1 register */
    for(u8SCRegister = u8NumChannel; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
    {
        /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
        /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
        REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
    }
    /* If optimize one-shot hardware trigger is enabled, there is just ONE channel in group so not need to disable remaining SC1 registers */
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) || (ADC_SETCHANNEL_API == STD_ON) */

     /* Save the Sc1Used register equal the number of channels configured */
     Adc_aUnitStatus[Unit].u8Sc1Used = u8NumChannel;

     /* Start software trigger through PDB or enable PDB hardware trigger */
     /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
     Adc_Pdb_ConfigurePartialConversion(Unit, Group, pGroupPtr, Trigger, CurrentChannel, u8NumChannel);
    
    /* Update current channel */
    Adc_aGroupStatus[Group].CurrentChannel += u8NumChannel;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_00();
}

#ifdef ADC_DMA_SUPPORTED

