xueshawu/S32K144/S32K144/Mcal/Adc_TS_T40D2M10I1R0/src/Adc_Adc12bsarv2.c
/** @violates @ref Adc_Adc12bsarv2_c_REF_10 internal linkage or external linkage */
FUNC(void, ADC_CODE) Adc_Adc12bsarv2_ConfigureDmaPartialConversion
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) Trigger,
    CONST(uint8, AUTOMATIC) u8NumChannel,
    CONST(boolean, AUTOMATIC) bFromIsr
)
{
    VAR(Adc_ChannelIndexType, AUTOMATIC) CurrentChannel;
    VAR(Adc_ChannelType, AUTOMATIC) Channel;
    VAR(Adc_ChannelType, AUTOMATIC) HwChannel;
    VAR(uint8, AUTOMATIC) u8SCRegister;
    VAR(uint32, AUTOMATIC) u32RegValue;
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) pResult = NULL_PTR;
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)  */
    P2CONST(Adc_GroupDefType, AUTOMATIC, ADC_APPL_CONST) pChannel = NULL_PTR;
#if (ADC_SETCHANNEL_API == STD_ON)
    VAR(uint32, AUTOMATIC) u32TempMask = Adc_aRuntimeGroupChannel[Group].u32Mask;
#endif

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_01();
    CurrentChannel = Adc_aGroupStatus[Group].CurrentChannel;
#if (ADC_SETCHANNEL_API == STD_ON)
    pChannel = Adc_aRuntimeGroupChannel[Group].pChannel;
#else
    pChannel = pGroupPtr->pAssignment;
#endif

    /* Disable interrupt for all used channels */
    /* Interrupt will be generated through MCL module */
    for(u8SCRegister = 0U; u8SCRegister < u8NumChannel; u8SCRegister++)
    {
#if (ADC_SETCHANNEL_API == STD_ON)
        /* Channel was changed? */
        if (1U == (u32TempMask & 1U))
#endif
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            Channel = pChannel[(CurrentChannel + u8SCRegister)];
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            HwChannel = Adc_pCfgPtr->pChannels[Unit][Channel].ChId;

            u32RegValue = ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | (HwChannel & ADC12BSARV2_ADCH_MASK_U32);
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), u32RegValue);
        }
#if (ADC_SETCHANNEL_API == STD_ON)
        u32TempMask = u32TempMask >> 1U;
        /* There are no channels changed then break out the loop */
        if (0U == u32TempMask)
        {
            break;
        }
#endif
    }
#if (STD_ON == ADC_ENABLE_DOUBLE_BUFFERING )
    if ((boolean)FALSE == pGroupPtr->bAdcDoubleBuffering)
#endif
    {
#if ((ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) || (ADC_SETCHANNEL_API == STD_ON))
        /* Disable others SC1 register */
        for(u8SCRegister = u8NumChannel; u8SCRegister < Adc_aUnitStatus[Unit].u8Sc1Used; u8SCRegister++)
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            REG_WRITE32(ADC12BSARV2_SC1_REG_ADDR32(Unit, (uint32)u8SCRegister), ADC12BSARV2_CONV_COMPLETE_INT_DIS_U32 | ADC12BSARV2_ADCH_CONVERSION_DISABLE_U32);
        }
#endif

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
        /* If this is not the first segment of the group, TCD must be reconfigured also */
        if((boolean)TRUE == bFromIsr)
        {
            /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
            pResult = Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + Adc_aGroupStatus[Group].ResultIndex + (CurrentChannel * pGroupPtr->NumSamples);
            Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32saddr = (uint32) ADC12BSARV2_Rn_REG_ADDR32(Unit, (uint32)0);
            Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32num_bytes = 2UL;
            /** @violates @ref Adc_Adc12bsarv2_c_REF_9 cast from unsigned long to pointer */
            /** @violates @ref Adc_Adc12bsarv2_c_REF_3 A cast should not be performed between a pointer type and an integral type. */
            Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32daddr = (uint32) pResult;
            Adc_Adc12bsarv2_aDmaTcdConfig[Unit].u32iter = (uint32) u8NumChannel;
            Mcl_DmaConfigTcd(Adc_Adc12bsarv2_aTcdAddress[Unit], &(Adc_Adc12bsarv2_aDmaTcdConfig[Unit]));
            Mcl_DmaTcdSetFlags(Adc_Adc12bsarv2_aTcdAddress[Unit], (uint8)(DMA_TCD_DISABLE_REQ_U8 | DMA_TCD_INT_MAJOR_U8));
        }
#endif
    }

    /* Save the Sc1Used register equal the number of channels configured */
    Adc_aUnitStatus[Unit].u8Sc1Used = u8NumChannel;
    /** @violates @ref Adc_Adc12bsarv2_c_REF_8 Array indexing shall be the only allowed form of pointer arithmetic */
    Adc_Pdb_ConfigurePartialConversion(Unit, Group, pGroupPtr, Trigger, CurrentChannel, u8NumChannel);
    
    Adc_aGroupStatus[Group].CurrentChannel += u8NumChannel;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_01();
    
    /* Avoid compiler warning */
    (void)bFromIsr;
}
#endif
#define ADC_STOP_SEC_CODE
/**
 * @violates @ref Adc_Adc12bsarv2_c_REF_1 Only preprocessor statements and comments before "#include"
 * @violates @ref Adc_Adc12bsarv2_c_REF_2 Repeated include file MemMap.h
 */
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */

